; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-3-5-9)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	s0 - location
	s1 - location
	s2 - location
	p0-2 - location
	p1-0 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s1)
	(at driver3 s1)
	(at truck1 s1)
	(empty truck1)
	(at truck2 s0)
	(empty truck2)
	(at truck3 s2)
	(empty truck3)
	(at truck4 s2)
	(empty truck4)
	(at truck5 s1)
	(empty truck5)
	(at package1 s2)
	(at package2 s2)
	(at package3 s2)
	(at package4 s0)
	(at package5 s0)
	(at package6 s0)
	(at package7 s2)
	(at package8 s1)
	(at package9 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 70)
	(= (time-to-walk p0-2 s0) 70)
	(= (time-to-walk s2 p0-2) 26)
	(= (time-to-walk p0-2 s2) 26)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 70)
	(= (time-to-walk p1-0 s1) 70)
	(= (time-to-walk s0 p1-0) 19)
	(= (time-to-walk p1-0 s0) 19)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 7)
	(= (time-to-drive s0 s2) 7)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 35)
	(= (time-to-drive s1 s2) 35)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s0)
	(at driver3 s0)
	(at truck1 s2)
	(at truck2 s0)
	(at truck3 s0)
	(at truck4 s0)
	(at truck5 s1)
	(at package1 s1)
	(at package2 s0)
	(at package3 s1)
	(at package4 s2)
	(at package5 s1)
	(at package6 s2)
	(at package7 s0)
	(at package8 s2)
	(at package9 s1)
	))

(:metric minimize (+ (+ (* 3  (total-time)) (* 4  (driven))) (* 3  (walked))))

)

; plan
1. (board-truck driver2 truck1 s1)
   deleted: (at driver2 s1) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 3 of 16
2. (walk driver3 s1 p1-0)
   deleted: (at driver3 s1)
   added: (at driver3 p1-0)
   changed: (walked) from 0 to 70
   goals met: 3 of 16
3. (load-truck package8 truck1 s1)
   deleted: (at package8 s1)
   added: (in package8 truck1)
   goals met: 3 of 16
4. (drive-truck truck1 s1 s2 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   changed: (driven) from 0 to 35
   goals met: 4 of 16
5. (walk driver3 p1-0 s0)
   deleted: (at driver3 p1-0)
   added: (at driver3 s0)
   changed: (walked) from 70 to 89
   goals met: 5 of 16
6. (unload-truck package8 truck1 s2)
   deleted: (in package8 truck1)
   added: (at package8 s2)
   goals met: 6 of 16
7. (walk driver1 s1 p1-0)
   deleted: (at driver1 s1)
   added: (at driver1 p1-0)
   changed: (walked) from 89 to 159
   goals met: 6 of 16
8. (walk driver1 p1-0 s0)
   deleted: (at driver1 p1-0)
   added: (at driver1 s0)
   changed: (walked) from 159 to 178
   goals met: 7 of 16
9. (load-truck package1 truck1 s2)
   deleted: (at package1 s2)
   added: (in package1 truck1)
   goals met: 7 of 16
10. (load-truck package2 truck1 s2)
   deleted: (at package2 s2)
   added: (in package2 truck1)
   goals met: 7 of 16
11. (load-truck package3 truck1 s2)
   deleted: (at package3 s2)
   added: (in package3 truck1)
   goals met: 7 of 16
12. (drive-truck truck1 s2 s0 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   changed: (driven) from 35 to 42
   goals met: 6 of 16
13. (load-truck package5 truck1 s0)
   deleted: (at package5 s0)
   added: (in package5 truck1)
   goals met: 6 of 16
14. (load-truck package4 truck1 s0)
   deleted: (at package4 s0)
   added: (in package4 truck1)
   goals met: 6 of 16
15. (drive-truck truck1 s0 s2 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (driven) from 42 to 49
   goals met: 7 of 16
16. (unload-truck package4 truck1 s2)
   deleted: (in package4 truck1)
   added: (at package4 s2)
   goals met: 8 of 16
17. (load-truck package7 truck1 s2)
   deleted: (at package7 s2)
   added: (in package7 truck1)
   goals met: 8 of 16
18. (drive-truck truck1 s2 s0 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   changed: (driven) from 49 to 56
   goals met: 7 of 16
19. (unload-truck package2 truck1 s0)
   deleted: (in package2 truck1)
   added: (at package2 s0)
   goals met: 8 of 16
20. (load-truck package6 truck1 s0)
   deleted: (at package6 s0)
   added: (in package6 truck1)
   goals met: 8 of 16
21. (drive-truck truck1 s0 s2 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (driven) from 56 to 63
   goals met: 9 of 16
22. (unload-truck package6 truck1 s2)
   deleted: (in package6 truck1)
   added: (at package6 s2)
   goals met: 10 of 16
23. (drive-truck truck1 s2 s1 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   changed: (driven) from 63 to 98
   goals met: 9 of 16
24. (unload-truck package1 truck1 s1)
   deleted: (in package1 truck1)
   added: (at package1 s1)
   goals met: 10 of 16
25. (unload-truck package3 truck1 s1)
   deleted: (in package3 truck1)
   added: (at package3 s1)
   goals met: 11 of 16
26. (unload-truck package5 truck1 s1)
   deleted: (in package5 truck1)
   added: (at package5 s1)
   goals met: 12 of 16
27. (drive-truck truck1 s1 s2 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   changed: (driven) from 98 to 133
   goals met: 13 of 16
28. (disembark-truck driver2 truck1 s2)
   deleted: (driving driver2 truck1)
   added: (at driver2 s2) (empty truck1)
   goals met: 13 of 16
29. (board-truck driver2 truck3 s2)
   deleted: (at driver2 s2) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 13 of 16
30. (unload-truck package7 truck1 s2)
   deleted: (in package7 truck1)
   added: (at package7 s2)
   goals met: 13 of 16
31. (load-truck package7 truck3 s2)
   deleted: (at package7 s2)
   added: (in package7 truck3)
   goals met: 13 of 16
32. (drive-truck truck3 s2 s0 driver2)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   changed: (driven) from 133 to 140
   goals met: 14 of 16
33. (unload-truck package7 truck3 s0)
   deleted: (in package7 truck3)
   added: (at package7 s0)
   goals met: 15 of 16
34. (walk driver3 s0 p0-2)
   deleted: (at driver3 s0)
   added: (at driver3 p0-2)
   changed: (walked) from 178 to 248
   goals met: 14 of 16
35. (walk driver3 p0-2 s2)
   deleted: (at driver3 p0-2)
   added: (at driver3 s2)
   changed: (walked) from 248 to 274
   goals met: 14 of 16
36. (board-truck driver3 truck4 s2)
   deleted: (at driver3 s2) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 14 of 16
37. (drive-truck truck4 s2 s0 driver3)
   deleted: (at truck4 s2)
   added: (at truck4 s0)
   changed: (driven) from 140 to 147
   goals met: 15 of 16
38. (disembark-truck driver3 truck4 s0)
   deleted: (driving driver3 truck4)
   added: (at driver3 s0) (empty truck4)
   goals met: 16 of 16
